iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_tcd1209.c
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author            Notes
 * 2021-10-01     iysheng           TCD1209 driver
 */

#include <rtconfig.h>
#include <rtdevice.h>
#include "gd32f20x_timer.h"
#include "gd32f20x_dma.h"
#include "drv_gpio.h"
#include "drv_tcd1209.h"
#include <rthw.h>

#define DBG_LVL    DBG_INFO
#define DBG_TAG    "tcd1209"
#include <rtdbg.h>

static uint16_t _gs_ad9945_data[AD9945_DATA_COUNTS], _gs_ad9945_data4portc[AD9945_DATA_COUNTS];
static uint16_t gs_ccd_raw_value[AD9945_DATA_COUNTS];
static uint16_t gs_index;
static uint8_t gs_sync4dma_flag = 0x80;
static uint8_t gs_type4scan_mode = SCAN_TYPE_ONESHOT;
static uint8_t _gs_catch_command = 0;

static uint8_t gs_just_test_led;

void mark_catch_command(uint8_t status)
{
    _gs_catch_command = status;
}

/*
 * CCD 标定位置以及参数配置,包含实际的采样信息
 * */
static ccd_data_map_t gs_sample_test = {
    .threshold = 2000,
    .delta = 10,
    .position = {
        600,900,600,
    },
};

static ccd_data_t gs_calibrate_data;

static inline uint16_t get_ccd_value2index(uint16_t index)
{
    uint16_t ccd_value = 0;

    /*
     * bit [11:0]
     * C4:C5:B0:B1:B2:B10:B11:B7:B8:B9:C0:C1
     * */

    ccd_value = 0;
    ccd_value = (_gs_ad9945_data4portc[index] & 0x10) << 7;
    ccd_value |= (_gs_ad9945_data4portc[index] & 0x20) << 5;
    ccd_value |= (_gs_ad9945_data[index] & 0x01) << 9;
    ccd_value |= (_gs_ad9945_data[index] & 0x02) << 7;
    ccd_value |= (_gs_ad9945_data[index] & 0x04) << 5;
    ccd_value |= (_gs_ad9945_data[index] & 0x400) >> 4;
    ccd_value |= (_gs_ad9945_data[index] & 0x800) >> 6;
    ccd_value |= (_gs_ad9945_data[index] & 0x80) >> 3;
    ccd_value |= (_gs_ad9945_data[index] & 0x100) >> 5;
    ccd_value |= (_gs_ad9945_data[index] & 0x200) >> 7;
    ccd_value |= (_gs_ad9945_data4portc[index] & 0x01) << 1;
    ccd_value |= (_gs_ad9945_data4portc[index] & 0x02) >> 1;

    return ccd_value;
}

static inline void raw_data_sync(void)
{
    int i = 0;
    uint16_t raw_value_tmp;

    for (; i < AD9945_DATA_COUNTS; i++)
    {
        raw_value_tmp = get_ccd_value2index(i);
        //if (i < 50)
        //    rt_kprintf("%u]", raw_value_tmp);
        //gs_ccd_raw_value[i] = raw_value_tmp > gs_ccd_raw_value[i] ? raw_value_tmp : gs_ccd_raw_value[i];
        gs_ccd_raw_value[i] = raw_value_tmp;
    }
    //rt_kprintf("\n");
}

static inline void raw_data_clear(void)
{
    int i = 0;
    uint32_t * ptr = (uint32_t *)&gs_ccd_raw_value[0];

    for (; i < AD9945_DATA_COUNTS / 2; i++)
    {
        *ptr++ = 0x00;
    }
}

static inline void ccd_scan_restart(void)
{
    gs_index = 0;
    dma_transfer_number_config(DMA0, DMA_CH0, AD9945_DATA_COUNTS);
    dma_transfer_number_config(DMA0, DMA_CH4, AD9945_DATA_COUNTS);
    dma_channel_enable(DMA0, DMA_CH0);
    dma_channel_enable(DMA0, DMA_CH4);
    timer_interrupt_flag_clear(TIMER7, TIMER_INT_FLAG_CH3);
    timer_interrupt_enable(TIMER7, TIMER_INT_CH3);
}

void ccd_scan_recovery(void)
{
    if (likely(_gs_catch_command && SCAN_TYPE_CONTINUOUS == gs_type4scan_mode))
    {
        ccd_scan_restart();
        _gs_catch_command = 0;
    }
}

/*
 * AHB = 120M
 * APB2 = 120M
 * APB1 = 60M
 *
 * APB1 的分频作为 TIMER1/2/3/4/5/6 11/12/13 的时钟, 最大为 60MHz 并且如果分频为 1 ,那么 x1 否则 x2
 * APB2 的分频作为 TIMER0/7/8/9/10 的时钟, 最大为 120MHz 并且如果分频为 1 ,那么 x1 否则 x2
 * */
#if 0
/**
  * @brief 获取指定寄存器地址的数据
  * @param uint8_t reg_addr:
  * retval 寄存器地址的数据.
  */
static uint16_t _get_ad9945_reg_value(uint8_t reg_addr)
{
    int addr_index = 0;
    uint16_t reg_value = 0;

    rt_pin_mode(GD32_AD9945_SDA_PIN, PIN_MODE_OUTPUT);
    rt_pin_write(GD32_AD9945_SL_PIN, PIN_LOW);

    for (; addr_index < 4; addr_index ++)
    {
        rt_pin_write(GD33_AD9945_SDA_PIN, reg_addr >> addr_index & 0x01);
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_LOW);
        rt_thread_mdelay(1);
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_HIGH);
        rt_thread_mdelay(1);
    }
    rt_pin_mode(GD32_AD9945_SDA_PIN, PIN_MODE_INPUT);
    for (addr_index = 0; addr_index < 12; addr_index ++)
    {
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_LOW);
        rt_thread_mdelay(1);
        reg_value |= (rt_pin_read(GD32_AD9945_SDA_PIN) & 0x01) << addr_index;
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_HIGH);
        rt_thread_mdelay(1);
    }

    return reg_value;
}
#endif

/**
  * @brief 设置指定寄存器地址的数据
  * @param uint8_t reg_addr:
  * @param uint16_t reg_data:
  * retval N/A.
  */
static void _set_ad9945_reg_value(uint8_t reg_addr, uint16_t reg_data)
{
    int addr_index = 0;

    rt_pin_write(GD32_AD9945_SL_PIN, PIN_LOW);
    rt_thread_mdelay(1);

    for (; addr_index < 4; addr_index ++)
    {
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_LOW);
        rt_pin_write(GD32_AD9945_SDA_PIN, reg_addr >> addr_index & 0x01);
        rt_thread_mdelay(1);
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_HIGH);
        rt_thread_mdelay(1);
    }
    for (addr_index = 0; addr_index < 12; addr_index ++)
    {
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_LOW);
        rt_pin_write(GD32_AD9945_SDA_PIN, reg_data >> addr_index & 0x01);
        rt_thread_mdelay(1);
        rt_pin_write(GD32_AD9945_SCK_PIN, PIN_HIGH);
        rt_thread_mdelay(1);
    }
    rt_pin_write(GD32_AD9945_SL_PIN, PIN_HIGH);
}

/**
  * @brief 获取指定寄存器地址的数据
  * @param uint8_t reg_addr:
  * retval 寄存器地址的数据.
  */
static uint16_t _get_ad9945_ad_value(void)
{
    rt_uint16_t port_b_value, port_c_value;

    port_b_value = gpio_input_port_get(GPIOB);
    port_c_value = gpio_input_port_get(GPIOC);

    port_b_value &= 0xc7f;
    port_c_value &= 0x1c00;
    port_c_value >>= 10;
    port_b_value |= port_c_value << 7;

    return port_b_value;
}

#if 0
void TIMER1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    if (gs_index == AD9945_DATA_COUNTS)
    {
        timer_interrupt_disable(TIMER1, TIMER_INT_CH0);
    }
#if 0
    else if (gs_index < 100)
    {
        rt_pin_write(GD32_AD9945_CLPOB_PIN, RESET);
    }
    else
    {
        rt_pin_write(GD32_AD9945_CLPOB_PIN, SET);
    }
#endif
    if (SET == timer_interrupt_flag_get(TIMER1, TIMER_INT_FLAG_CH0))
    {
        timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_CH0);
     //   gs_ad9915_data[gs_index++ % AD9945_DATA_COUNTS] = _get_ad9915_ad_value();
    }
    /* leave interrupt */
    rt_interrupt_leave();
}
#endif


