iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_tcd1209.c
void TIMER7_Channel_IRQHandler(void)
{
    rt_base_t level;
    /* enter interrupt */
    rt_interrupt_enter();

#if 1
    if (SET == timer_flag_get(TIMER7, TIMER_FLAG_CH3))
    {
        if ((gs_index == 0) && (gs_sync4dma_flag & 0x80))
        {
            //timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, 10);
            //timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, 10);
            /* DATACLK 定时器开启 */
            timer_enable(TIMER1);
            gs_index = 1;
        }
        else if (!(gs_sync4dma_flag & 0x80))
        {
            gs_sync4dma_flag |= 0x80;
        }
        timer_interrupt_flag_clear(TIMER7, TIMER_INT_FLAG_CH3);
    }
#else
    if (SET == timer_flag_get(TIMER7, TIMER_FLAG_CH3))
    {
        timer_interrupt_flag_clear(TIMER7, TIMER_INT_FLAG_CH3);
        rt_pin_write(21, gs_just_test_led++%2);
    }
#endif
    /* leave interrupt */
    rt_interrupt_leave();
}

/**
  * @brief 初始化 DMA 完成 AD9945 输出的 AD 数据搬移
  * @param void:
  * retval N/A.
  */
static void dma_init4ad9945(void)
{
    dma_parameter_struct dma_param4dataclk_portb, dma_param4dataclk_portc;

    rcu_periph_clock_enable(RCU_DMA0);
    dma_param4dataclk_portb.periph_addr  = GPIOB + 0x08U;
    dma_param4dataclk_portb.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_param4dataclk_portb.periph_inc   = (uint8_t)DMA_PERIPH_INCREASE_DISABLE;
    dma_param4dataclk_portb.memory_addr  = (uint32_t)&_gs_ad9945_data[0];
    dma_param4dataclk_portb.memory_width = DMA_MEMORY_WIDTH_16BIT;
    dma_param4dataclk_portb.memory_inc   = (uint8_t)DMA_MEMORY_INCREASE_ENABLE;
    dma_param4dataclk_portb.number       = AD9945_DATA_COUNTS;
    dma_param4dataclk_portb.direction    = (uint8_t)DMA_PERIPHERAL_TO_MEMORY;
    dma_param4dataclk_portb.priority     = DMA_PRIORITY_HIGH;

    dma_param4dataclk_portc.periph_addr  = GPIOC + 0x08U;
    dma_param4dataclk_portc.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_param4dataclk_portc.periph_inc   = (uint8_t)DMA_PERIPH_INCREASE_DISABLE;
    dma_param4dataclk_portc.memory_addr  = (uint32_t)&_gs_ad9945_data4portc[0];
    dma_param4dataclk_portc.memory_width = DMA_MEMORY_WIDTH_16BIT;
    dma_param4dataclk_portc.memory_inc   = (uint8_t)DMA_MEMORY_INCREASE_ENABLE;
    dma_param4dataclk_portc.number       = AD9945_DATA_COUNTS;
    dma_param4dataclk_portc.direction    = (uint8_t)DMA_PERIPHERAL_TO_MEMORY;
    dma_param4dataclk_portc.priority     = DMA_PRIORITY_HIGH;

    dma_init(DMA0, DMA_CH0, &dma_param4dataclk_portb);
    dma_init(DMA0, DMA_CH4, &dma_param4dataclk_portc);
    NVIC_SetPriority(DMA0_Channel0_IRQn, 0x40);
    NVIC_EnableIRQ(DMA0_Channel0_IRQn);
    NVIC_SetPriority(DMA0_Channel4_IRQn, 0x40);
    NVIC_EnableIRQ(DMA0_Channel4_IRQn);
    dma_interrupt_enable(DMA0, DMA_CH0, DMA_INT_FTF | DMA_INT_ERR);
    dma_interrupt_enable(DMA0, DMA_CH4, DMA_INT_FTF | DMA_INT_ERR);
    LOG_I("DMA init ok");
}

/**
  * @brief 初始化调节 pwm 补光灯
  * @param void:
  * retval N/A.
  */
static void pwm_adj4led_init(void)
{
    timer_parameter_struct timer4led;

    timer4led.prescaler         = 119U;
    timer4led.alignedmode       = TIMER_COUNTER_EDGE;
    timer4led.counterdirection  = TIMER_COUNTER_UP;
    timer4led.period            = 0U;
    timer4led.clockdivision     = TIMER_CKDIV_DIV1;
    timer4led.repetitioncounter = 0U;

    rcu_periph_clock_enable(RCU_TIMER11);
    timer_init(TIMER11, &timer4led);
    timer_channel_output_mode_config(TIMER11, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER11, 1000);
    timer_channel_output_pulse_value_config(TIMER11, TIMER_CH_0, 300);
    timer_channel_output_state_config(TIMER11, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER11, TIMER_INT_CH0);
    timer_enable(TIMER11);

    LOG_I("pwm for adj led init");
}

/**
  * @brief AD9945 初始化
  * param void:
  * retval .
  */
static void ad9945_device_init(void)
{
    /* timer 4 AD9945 device */
    timer_parameter_struct timer4shp, timer4shd, timer4dataclk, timer4clpob, timer4pblk;
    timer_oc_parameter_struct timer_oc4clpob;
    uint32_t init_value4shp = 6, init_value4shd = 12, init_value4dataclk = 10;
    uint32_t init_value4clpob = 0, init_value4pblk = 0;

    timer4shp.prescaler         = 5U;
    timer4shp.alignedmode       = TIMER_COUNTER_EDGE;
    timer4shp.counterdirection  = TIMER_COUNTER_UP;
    timer4shp.period            = 0U;
    timer4shp.clockdivision     = TIMER_CKDIV_DIV1;
    timer4shp.repetitioncounter = 0U;

    timer4shd.prescaler         = 5U;
    timer4shd.alignedmode       = TIMER_COUNTER_EDGE;
    timer4shd.counterdirection  = TIMER_COUNTER_UP;
    timer4shd.period            = 0U;
    timer4shd.clockdivision     = TIMER_CKDIV_DIV1;
    timer4shd.repetitioncounter = 0U;

    timer4dataclk.prescaler         = 5U;
    timer4dataclk.alignedmode       = TIMER_COUNTER_EDGE;
    timer4dataclk.counterdirection  = TIMER_COUNTER_UP;
    timer4dataclk.period            = 0U;
    timer4dataclk.clockdivision     = TIMER_CKDIV_DIV1;
    timer4dataclk.repetitioncounter = 0U;

    rcu_periph_clock_enable(RCU_TIMER8);
    timer_init(TIMER8, &timer4shp);
    timer_channel_output_mode_config(TIMER8, TIMER_CH_1, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER8, 19);
    timer_channel_output_pulse_value_config(TIMER8, TIMER_CH_1, 18);
    timer_channel_output_state_config(TIMER8, TIMER_CH_1, ENABLE);
    timer_interrupt_disable(TIMER8, TIMER_INT_CH1);

    rcu_periph_clock_enable(RCU_TIMER4);
    timer_init(TIMER4, &timer4shd);
    timer_channel_output_mode_config(TIMER4, TIMER_CH_2, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER4, 19);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, 18);
    timer_channel_output_state_config(TIMER4, TIMER_CH_2, ENABLE);
    timer_interrupt_disable(TIMER4, TIMER_INT_CH2);

    rcu_periph_clock_enable(RCU_TIMER1);
    timer_init(TIMER1, &timer4dataclk);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER1, 19);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, 10);
    timer_channel_output_state_config(TIMER1, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER1, TIMER_INT_CH0);
    timer_counter_value_config(TIMER1, init_value4dataclk);
    timer_counter_value_config(TIMER8, init_value4shp);
    timer_counter_value_config(TIMER4, init_value4shd);
    timer_enable(TIMER4);
    timer_enable(TIMER8);
    //timer_enable(TIMER1);

    timer4clpob.prescaler         = 119U;
    timer4clpob.alignedmode       = TIMER_COUNTER_EDGE;
    timer4clpob.counterdirection  = TIMER_COUNTER_UP;
    timer4clpob.period            = 0U;
    timer4clpob.clockdivision     = TIMER_CKDIV_DIV1;
    timer4clpob.repetitioncounter = 0U;

