iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_tcd1209.c
#if 0
    timer_oc4clpob.outputstate  = TIMER_CCX_DISABLE;
    timer_oc4clpob.outputnstate = TIMER_CCXN_ENABLE;
    timer_oc4clpob.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    timer_oc4clpob.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    timer_oc4clpob.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    timer_oc4clpob.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
#endif

    rcu_periph_clock_enable(RCU_TIMER12);
    timer_init(TIMER12, &timer4clpob);
    timer_channel_output_mode_config(TIMER12, TIMER_CH_0, TIMER_OC_MODE_PWM1);
    timer_autoreload_value_config(TIMER12, AD9945_DATA_COUNTS);
    timer_channel_output_pulse_value_config(TIMER12, TIMER_CH_0, 32);
    timer_channel_output_state_config(TIMER12, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER12, TIMER_INT_CH0);
    timer_counter_value_config(TIMER12, 23);
    timer_enable(TIMER12);

    timer4pblk.prescaler         = 119U;
    timer4pblk.alignedmode       = TIMER_COUNTER_EDGE;
    timer4pblk.counterdirection  = TIMER_COUNTER_UP;
    timer4pblk.period            = 0U;
    timer4pblk.clockdivision     = TIMER_CKDIV_DIV1;
    timer4pblk.repetitioncounter = 0U;

    rcu_periph_clock_enable(RCU_TIMER13);
    timer_init(TIMER13, &timer4pblk);
    timer_channel_output_mode_config(TIMER13, TIMER_CH_0, TIMER_OC_MODE_PWM1);
    timer_autoreload_value_config(TIMER13, AD9945_DATA_COUNTS);
    timer_channel_output_pulse_value_config(TIMER13, TIMER_CH_0, 30);
    timer_channel_output_state_config(TIMER13, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER13, TIMER_INT_CH0);

#if 1
    timer_enable(TIMER13);
#else
    gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);
    gpio_bit_set(GPIOA, GPIO_PIN_7);
    //gpio_init(GPIOA, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);
    //gpio_bit_set(GPIOA, GPIO_PIN_6);
#endif

#if 1
    /* just for another dma for portc */
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_PWM0);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, 10);
    timer_channel_output_state_config(TIMER1, TIMER_CH_2, DISABLE);
    timer_interrupt_disable(TIMER1, TIMER_INT_CH2);
    timer_channel_dma_request_source_select(TIMER1, TIMER_DMAREQUEST_CHANNELEVENT);
    timer_dma_enable(TIMER1, TIMER_DMA_CH0D);
    timer_dma_enable(TIMER1, TIMER_DMA_CH2D);
#endif

#if 0
    NVIC_SetPriority(TIMER1_IRQn, 0x0a);
    NVIC_EnableIRQ(TIMER1_IRQn);
#endif

#if 1
    //rt_pin_write(GD32_AD9945_PBLK_PIN, SET);
    /* 放开钳位 */
    _set_ad9945_reg_value(0x00, 0x08);
    _set_ad9945_reg_value(0x01, 0x00);
    /* 修改钳位 */
    _set_ad9945_reg_value(0x02, 00);
    /* 设置增益为 6dB */
    _set_ad9945_reg_value(0x03, 0x00);
    _set_ad9945_reg_value(0x0d, 0x838);
#endif
    dma_init4ad9945();
    gpio_bit_set(GPIOB, GPIO_PIN_5);
    LOG_I("AD9945 START");
}

int tcd1209_hw_init(void)
{
    int ret;
    /* timer 4 TCD1209 device */
    timer_parameter_struct timer4f1, timer4cp, timer4rs, timer4sh;
    timer_oc_parameter_struct timer_oc4f;
    uint32_t init_value4f = 4, init_value4cp = 4, init_value4rs = 0, init_value4sh = 0;

    timer4f1.prescaler         = 5U;
    timer4f1.alignedmode       = TIMER_COUNTER_EDGE;
    timer4f1.counterdirection  = TIMER_COUNTER_UP;
    timer4f1.period            = 0U;
    timer4f1.clockdivision     = TIMER_CKDIV_DIV1;
    timer4f1.repetitioncounter = 0U;

    timer_oc4f.outputstate  = TIMER_CCX_ENABLE;
    timer_oc4f.outputnstate = TIMER_CCXN_ENABLE;
    timer_oc4f.ocpolarity   = TIMER_OC_POLARITY_HIGH;
    timer_oc4f.ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    timer_oc4f.ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    timer_oc4f.ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;

    timer4cp.prescaler         = 5U;
    timer4cp.alignedmode       = TIMER_COUNTER_EDGE;
    timer4cp.counterdirection  = TIMER_COUNTER_UP;
    timer4cp.period            = 0U;
    timer4cp.clockdivision     = TIMER_CKDIV_DIV1;
    timer4cp.repetitioncounter = 0U;

    timer4rs.prescaler         = 5U;
    timer4rs.alignedmode       = TIMER_COUNTER_EDGE;
    timer4rs.counterdirection  = TIMER_COUNTER_UP;
    timer4rs.period            = 0U;
    timer4rs.clockdivision     = TIMER_CKDIV_DIV1;
    timer4rs.repetitioncounter = 0U;

    timer4sh.prescaler         = 119U;
    timer4sh.alignedmode       = TIMER_COUNTER_EDGE;
    timer4sh.counterdirection  = TIMER_COUNTER_UP;
    timer4sh.period            = 0U;
    timer4sh.clockdivision     = TIMER_CKDIV_DIV1;
    timer4sh.repetitioncounter = 0U;

    LOG_I("Hello TCD1209");

    rcu_periph_clock_enable(RCU_TIMER7);
    timer_init(TIMER7, &timer4sh);
    timer_channel_output_mode_config(TIMER7, TIMER_CH_3, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER7, AD9945_DATA_COUNTS);
    timer_channel_output_pulse_value_config(TIMER7, TIMER_CH_3, 1);
    timer_channel_output_state_config(TIMER7, TIMER_CH_3, ENABLE);
    timer_primary_output_config(TIMER7, ENABLE);
    timer_interrupt_disable(TIMER7, TIMER_INT_CH3);
    timer_enable(TIMER7);
    NVIC_SetPriority(TIMER7_Channel_IRQn, 0x0);
    NVIC_EnableIRQ(TIMER7_Channel_IRQn);
    //rt_thread_mdelay(1);
    rcu_periph_clock_enable(RCU_TIMER0);
    timer_init(TIMER0, &timer4f1);
    timer_channel_output_mode_config(TIMER0, TIMER_CH_0, TIMER_OC_MODE_PWM1);
    timer_autoreload_value_config(TIMER0, 19);
    timer_channel_output_pulse_value_config(TIMER0, TIMER_CH_0, 10);
    timer_channel_output_state_config(TIMER0, TIMER_CH_0, ENABLE);
    timer_channel_output_config(TIMER0, TIMER_CH_0, &timer_oc4f);
    timer_primary_output_config(TIMER0, ENABLE);
    timer_interrupt_disable(TIMER0, TIMER_INT_CH0);

    rcu_periph_clock_enable(RCU_TIMER2);
    timer_init(TIMER2, &timer4cp);
    timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER2, 19);
    timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_0, 2);
    timer_channel_output_state_config(TIMER2, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER2, TIMER_INT_CH0);

    rcu_periph_clock_enable(RCU_TIMER3);
    timer_init(TIMER3, &timer4rs);
    timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_PWM0);
    timer_autoreload_value_config(TIMER3, 19);
    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, 2);
    timer_channel_output_state_config(TIMER3, TIMER_CH_0, ENABLE);
    timer_interrupt_disable(TIMER3, TIMER_INT_CH0);

