iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_tcd1209.c
    timer_counter_value_config(TIMER2, init_value4cp);
    timer_counter_value_config(TIMER0, init_value4f);
    timer_counter_value_config(TIMER3, init_value4rs);
    timer_enable(TIMER2);
    timer_enable(TIMER0);
    timer_enable(TIMER3);
    ad9945_device_init();
    pwm_adj4led_init();

    return ret;
}
INIT_PREV_EXPORT(tcd1209_hw_init);

int convert_calibrate_ans(uint16_t *data, uint16_t data_len)
#if 1
{
    uint32_t sum = 0;
    uint16_t i = 0;
#if 0
    for (; i < data_len; i++)
    {
        sum += data[i];
    }
    sum /= data_len;
#else
	sum = gs_sample_test.threshold;
#endif
    //rt_kprintf("sum:%u, left=%u\n", sum, gs_sample_test.position.left);
    gs_sample_test.value.left = 0;
    gs_sample_test.value.middle = 0;
    gs_sample_test.value.right = 0;

    /* 暗电压是低电平 */
    for (i = 0; i < gs_sample_test.position.left; i++)
    {
        gs_sample_test.value.left += data[i] < sum ? 1 : 0;
    }
    for (; i < gs_sample_test.position.left + gs_sample_test.position.middle; i++)
    {
        gs_sample_test.value.middle += data[i] < sum ? 1 : 0;
    }
    for (; i < gs_sample_test.position.left + gs_sample_test.position.middle + gs_sample_test.position.right; i++)
    {
        gs_sample_test.value.right += data[i] < sum ? 1 : 0;
    }

    //rt_kprintf("scan ans:%hu,%hu,%hu\n", gs_sample_test.value.left, gs_sample_test.value.middle, gs_sample_test.value.right);
    return 0;
}
#else
{
    uint32_t sum = 0;
    uint16_t i = 0;

    for (; i < data_len; i++)
    {
        sum += data[i];
    }
    sum /= data_len;
    rt_kprintf("sum:%u, left=%u\n", sum, gs_sample_test.position.left);

    if (likely(gs_sample_test.value.left + gs_sample_test.value.middle + gs_sample_test.value.right != 0))
    {
        for (i = 0; i < gs_sample_test.position.left; i++)
        {
            gs_sample_test.value.left += data[i] > sum ? 1 : 0;
        }
        for (; i < gs_sample_test.position.left + gs_sample_test.position.middle; i++)
        {
            gs_sample_test.value.middle += data[i] > sum ? 1 : 0;
        }
        for (; i < gs_sample_test.position.left + gs_sample_test.position.middle + gs_sample_test.position.right; i++)
        {
            gs_sample_test.value.right += data[i] > sum ? 1 : 0;
        }
        gs_sample_test.value.left >>= 1;
        gs_sample_test.value.middle >>= 1;
        gs_sample_test.value.right >>= 1;
    }
    else
    {
        for (i = 0; i < gs_sample_test.position.left; i++)
        {
            gs_sample_test.value.left += data[i] > sum ? 1 : 0;
        }
        for (; i < gs_sample_test.position.left + gs_sample_test.position.middle; i++)
        {
            gs_sample_test.value.middle += data[i] > sum ? 1 : 0;
        }
        for (; i < gs_sample_test.position.left + gs_sample_test.position.middle + gs_sample_test.position.right; i++)
        {
            gs_sample_test.value.right += data[i] > sum ? 1 : 0;
        }
    }

    rt_kprintf("scan ans:%hu,%hu,%hu\n", gs_sample_test.value.left, gs_sample_test.value.middle, gs_sample_test.value.right);
    return 0;
}
#endif

static inline void convert_raw2data_sync(void)
{
    convert_calibrate_ans(gs_ccd_raw_value, AD9945_DATA_COUNTS);
}

static inline void save_calibrate_data(void)
{
    gs_calibrate_data = gs_sample_test.value;
    rt_kprintf("calibrate%u.%u.%u\n", gs_calibrate_data.left, gs_calibrate_data.middle, gs_calibrate_data.right);
}

static inline int compare_with_calibrate(void)
{
    int16_t delta;

    delta = gs_calibrate_data.left - gs_sample_test.value.left;
    if ((delta > gs_sample_test.delta) || delta + gs_sample_test.delta < 0)
    {
        return 1;
    }

    delta = gs_calibrate_data.middle - gs_sample_test.value.middle;
    if ((delta > gs_sample_test.delta) || delta + gs_sample_test.delta < 0)
    {
        return 1;
    }

    delta = gs_calibrate_data.right - gs_sample_test.value.right;
    if ((delta > gs_sample_test.delta) || delta + gs_sample_test.delta < 0)
    {
        return 1;
    }

    return 0;
}

long calibrate_ans(void)
{
    rt_kprintf("int16_t=%u ans:%hu,%hu,%hu\n", sizeof(int16_t), gs_calibrate_data.left, gs_calibrate_data.middle, gs_calibrate_data.right);
}
MSH_CMD_EXPORT(calibrate_ans, show calibrate info now);

int tcd1209_calibrate_triger(int times)
{
    if (likely(SCAN_TYPE_CONTINUOUS == gs_type4scan_mode))
    {
        if (likely(CHECK_END_TYPE == times))
        {
            /* TODO get calibrate ans and save */
            convert_raw2data_sync();
            save_calibrate_data();
            /* TODO clear original data */
            raw_data_clear();
        }
        else if (CHECK_START_TYPE == times)
        {

        }
        else
        {
            /* just ignore */
        }
    }
    else
    {
        if (CHECK_START_TYPE == times)
        {
            gs_type4scan_mode = SCAN_TYPE_CONTINUOUS;
        }
        else if (unlikely(CHECK_END_TYPE == times))
        {
            /* just ignore */
        }
        ccd_scan_restart();
        while(gs_index < AD9945_DATA_COUNTS);
        convert_raw2data_sync();
        save_calibrate_data();
    }

    return 0;
}

int tcd1209_get_delimiters_info(unsigned char *value, unsigned char len)
{
    value[0] = gs_sample_test.position.left >> 8;
    value[1] = gs_sample_test.position.left;
    value[2] = gs_sample_test.position.middle >> 8;
    value[3] = gs_sample_test.position.middle;
    value[4] = gs_sample_test.position.right >> 8;
    value[5] = gs_sample_test.position.right;

    return 0;
}

int tcd1209_get_check_info(unsigned char *value, unsigned char len)
{

    value[0] = gs_sample_test.value.left >> 8;
    value[1] = gs_sample_test.value.left;
    value[2] = gs_sample_test.value.middle >> 8;
    value[3] = gs_sample_test.value.middle;
    value[4] = gs_sample_test.value.right >> 8;
    value[5] = gs_sample_test.value.right;

    return 0;
}

int tcd1209_set_calibrate_delta_info(unsigned char *value, unsigned char len)
{
    /* TODO check parameter valid */
    if ((value[0] << 8 | value[1]) > 4095)
    {
        return -1;
    }
    gs_sample_test.delta = value[0] << 8 | value[1];
    ef_set_abs_ccd_info(&gs_sample_test);

