iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_tcd1209.c
    return 0;
}

int tcd1209_get_calibrate_delta_info(unsigned char *value, unsigned char len)
{
    /* TODO check parameter valid */
    value[0] = gs_sample_test.delta >> 8;
    value[1] = gs_sample_test.delta;

    return 0;
}

int tcd1209_set_delimiters_info(unsigned char *value, unsigned char len)
{
    /* TODO check parameter valid */
    if (((value[0] << 8 | value[1]) > AD9945_DATA_COUNTS) ||
        ((value[2] << 8 | value[3]) > AD9945_DATA_COUNTS) ||
        ((value[4] << 8 | value[5]) > AD9945_DATA_COUNTS) ||
        ((value[0] << 8 | value[1]) + (value[2] << 8 | value[3]) + \
           (value[4] << 8 | value[5]) > AD9945_DATA_COUNTS))
    {
		LOG_E("delimiters invalid");
        return -1;
    }

    gs_sample_test.position.left   = value[0] << 8 | value[1];
    gs_sample_test.position.middle = value[2] << 8 | value[3];
    gs_sample_test.position.right  = value[4] << 8 | value[5];
    ef_set_abs_ccd_info(&gs_sample_test);
}

int tcd1209_calibrate_set_info(unsigned char *value, unsigned char len)
{
    gs_sample_test.value.left = value[0] << 8 | value[1];
    gs_sample_test.value.middle = value[2] << 8 | value[3];
    gs_sample_test.value.right = value[4] << 8 | value[5];
    /* 写入到 flash 中 */
    save_calibrate_data();
    return 0;
}

int tcd1209_set_calibrate_threshold_info(unsigned char *value, unsigned char len)
{
    /* TODO check parameter valid */
    if ((value[0] << 8 | value[1]) > 4095)
    {
        return -1;
    }
    /* 如果带有写标志 */
    else if (value[6] == 1)
    {
        gs_sample_test.threshold = value[0] << 8 | value[1];
        ef_set_abs_ccd_info(&gs_sample_test);
    }

    return 0;
}

int tcd1209_get_calibrate_threshold_info(unsigned char *value, unsigned char len)
{
    /* TODO check parameter valid */
    value[0] = gs_sample_test.threshold >> 8;
    value[1] = gs_sample_test.threshold;

    return 0;
}

int tcd1209_calibrate_get_info(unsigned char *value, unsigned char len)
{
    if (likely(gs_sample_test.value.left + gs_sample_test.value.middle + gs_sample_test.value.right != 0))
    {
        value[0] = gs_sample_test.value.left >> 8 & 0xff;
        value[1] = gs_sample_test.value.left & 0xff;
        value[2] = gs_sample_test.value.middle >> 8 & 0xff;
        value[3] = gs_sample_test.value.middle & 0xff;
        value[4] = gs_sample_test.value.right >> 8 & 0xff;
        value[5] = gs_sample_test.value.right & 0xff;
        return 0;
    }
    else
    {
        return -1;
    }
}

int tcd1209_check_triger(int times)
{
    int ans = -1;
    if (likely(SCAN_TYPE_CONTINUOUS == gs_type4scan_mode))
    {
        if (likely(CHECK_END_TYPE == times || 0 == times))
        {
            /* TODO get check ans and compare */
            convert_raw2data_sync();
            ans = compare_with_calibrate();
            /* TODO clear original data */
            rt_kprintf("check(%d):%hd.%hd.%hd\n", ans, gs_sample_test.value.left,
                gs_sample_test.value.middle, gs_sample_test.value.right);
            rt_kprintf("calibrate check(%d):%hd.%hd.%hd\n", ans, gs_calibrate_data.left,
                gs_calibrate_data.middle, gs_calibrate_data.right);
            raw_data_clear();

        }
        else if (CHECK_START_TYPE == times)
        {

        }
        else
        {
            /* just ignore */
            //gs_type4scan_mode = SCAN_TYPE_ONESHOT;
        }
    }
    else
    {
        if (CHECK_START_TYPE == times)
        {
            gs_type4scan_mode = SCAN_TYPE_CONTINUOUS;
        }
        else if (unlikely(CHECK_END_TYPE == times))
        {
            /* TODO no support just */
        }
        ccd_scan_restart();
        while(gs_index < AD9945_DATA_COUNTS);
        convert_raw2data_sync();
    }

    return ans;
}

void tcd1209_register_abs_tcd_info(ccd_data_map_t *data)
{
    if (!data)
    {
        LOG_E("invalid ccd data info\n");
        return;
    }
    gs_sample_test = *data;
	/* 同步校准信息 */
    save_calibrate_data();
}

void DMA0_Channel0_IRQHandler(void)
{
    rt_interrupt_enter();
    if (SET == dma_flag_get(DMA0, DMA_CH0, DMA_FLAG_FTF))
    {
        dma_flag_clear(DMA0, DMA_CH0, DMA_FLAG_FTF);
        dma_channel_disable(DMA0, DMA_CH0);
        if (gs_sync4dma_flag & 0x10)
        {
            /* mark DMA transmit done */
            gs_index = AD9945_DATA_COUNTS;
            timer_disable(TIMER1);
            timer_interrupt_disable(TIMER7, TIMER_INT_CH3);
            raw_data_sync();
            rt_pin_write(21, gs_just_test_led++%2);
            if ((SCAN_TYPE_CONTINUOUS == gs_type4scan_mode) && (!_gs_catch_command))
            {
                convert_raw2data_sync();
                gs_sync4dma_flag = 0;
                ccd_scan_restart();
            }
        }
        else
        {
            /* mark DMA channel0 done */
            gs_sync4dma_flag |= 1;
        }
    }
    rt_interrupt_leave();
}

void DMA0_Channel4_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();
    if (SET == dma_flag_get(DMA0, DMA_CH4, DMA_FLAG_FTF))
    {
        dma_flag_clear(DMA0, DMA_CH4, DMA_FLAG_FTF);
        dma_channel_disable(DMA0, DMA_CH4);
        if (gs_sync4dma_flag & 0x01)
        {
            /* mark DMA transmit done */
            gs_index = AD9945_DATA_COUNTS;
            timer_disable(TIMER1);
            timer_interrupt_disable(TIMER7, TIMER_INT_CH3);
            raw_data_sync();
            rt_pin_write(21, gs_just_test_led++%2);
            if ((SCAN_TYPE_CONTINUOUS == gs_type4scan_mode) && (!_gs_catch_command))
            {
                convert_raw2data_sync();
                ccd_scan_restart();
                gs_sync4dma_flag = 0;
            }
        }
        else
        {
            /* mark DMA channel4 done */
            gs_sync4dma_flag |= 0x10;
        }
    }
    /* leave interrupt */
    rt_interrupt_leave();
}

long show_ad9945(void)
{
    tcd1209_calibrate_triger(1);
    calibrate_ans();
    return 0;
}
MSH_CMD_EXPORT(show_ad9945, list device in system);

long adj_led(int argc, char *argv[])
{
    timer_channel_output_pulse_value_config(TIMER11, TIMER_CH_0, atoi(argv[1]));
}
MSH_CMD_EXPORT(adj_led, adjust led level);

/* 设置钳位 */
long adj_ob(int argc, char *argv[])
{
    if (argc > 1)
    {
        _set_ad9945_reg_value(0x02, 0xff & atoi(argv[1]));
        _set_ad9945_reg_value(0x0d, 0x838);
    }

    return 0;
}
MSH_CMD_EXPORT(adj_ob, adjust ob clamp level);

/* 设置阈值 */
long adj_thresholod(int argc, char *argv[])
{
	int16_t threshold = 0;
    if (argc > 1)
    {
        threshold = (int16_t)atoi(argv[1]);
        if (threshold > 4095 || threshold < 0)
        {
            LOG_E("invalid threshold value:%d", threshold);
            return -1;
        }
        gs_sample_test.threshold = threshold;
        ef_set_abs_ccd_info(&gs_sample_test);
        LOG_I("Set threshold to:%u", atoi(argv[1]));
    }

    return 0;
}
MSH_CMD_EXPORT(adj_thresholod, adjust threshold value);
